# SpatialFieldMgrLegendHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpatialFieldMgrLegendHeight Property
ParameterTypeId Class See Also
---
"Legend Height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpatialFieldMgrLegendHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpatialFieldMgrLegendHeight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpatialFieldMgrLegendHeight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace